app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Space Balls"], ["rating", "PG"], ["release_date", "1987-06-24 00:00:00.000000"], ["updated_at", "2018-10-09 02:19:02.972100"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."Director" = 'Hans Zimmer'
---
  def same_director
    @movie = Movie.find(params[:id])
    director = @movie.director
    if director && !director.empty? then
      @movies = Movie.where(Director: director)